Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ451/include/component/pac.h
/**
 * \brief Component description for PAC
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-01-20T19:13:34Z */
#ifndef _BZ45_PAC_COMPONENT_H_
#define _BZ45_PAC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PAC                                          */
/* ************************************************************************** */

/* -------- PAC_WRCTRL : (PAC Offset: 0x00) (R/W 32) Write control -------- */
#define PAC_WRCTRL_RESETVALUE                 _U_(0x00)                                            /**<  (PAC_WRCTRL) Write control  Reset Value */

#define PAC_WRCTRL_PERID_Pos                  _U_(0)                                               /**< (PAC_WRCTRL) Peripheral identifier Position */
#define PAC_WRCTRL_PERID_Msk                  (_U_(0xFFFF) << PAC_WRCTRL_PERID_Pos)                /**< (PAC_WRCTRL) Peripheral identifier Mask */
#define PAC_WRCTRL_PERID(value)               (PAC_WRCTRL_PERID_Msk & ((value) << PAC_WRCTRL_PERID_Pos))
#define PAC_WRCTRL_KEY_Pos                    _U_(16)                                              /**< (PAC_WRCTRL) Peripheral access control key Position */
#define PAC_WRCTRL_KEY_Msk                    (_U_(0xFF) << PAC_WRCTRL_KEY_Pos)                    /**< (PAC_WRCTRL) Peripheral access control key Mask */
#define PAC_WRCTRL_KEY(value)                 (PAC_WRCTRL_KEY_Msk & ((value) << PAC_WRCTRL_KEY_Pos))
#define   PAC_WRCTRL_KEY_OFF_Val              _U_(0x0)                                             /**< (PAC_WRCTRL) No action  */
#define   PAC_WRCTRL_KEY_CLR_Val              _U_(0x1)                                             /**< (PAC_WRCTRL) Clear protection  */
#define   PAC_WRCTRL_KEY_SET_Val              _U_(0x2)                                             /**< (PAC_WRCTRL) Set protection  */
#define   PAC_WRCTRL_KEY_SETLCK_Val           _U_(0x3)                                             /**< (PAC_WRCTRL) Set and lock protection  */
#define PAC_WRCTRL_KEY_OFF                    (PAC_WRCTRL_KEY_OFF_Val << PAC_WRCTRL_KEY_Pos)       /**< (PAC_WRCTRL) No action Position  */
#define PAC_WRCTRL_KEY_CLR                    (PAC_WRCTRL_KEY_CLR_Val << PAC_WRCTRL_KEY_Pos)       /**< (PAC_WRCTRL) Clear protection Position  */
#define PAC_WRCTRL_KEY_SET                    (PAC_WRCTRL_KEY_SET_Val << PAC_WRCTRL_KEY_Pos)       /**< (PAC_WRCTRL) Set protection Position  */
#define PAC_WRCTRL_KEY_SETLCK                 (PAC_WRCTRL_KEY_SETLCK_Val << PAC_WRCTRL_KEY_Pos)    /**< (PAC_WRCTRL) Set and lock protection Position  */
#define PAC_WRCTRL_Msk                        _U_(0x00FFFFFF)                                      /**< (PAC_WRCTRL) Register Mask  */


/* -------- PAC_EVCTRL : (PAC Offset: 0x04) (R/W 8) Event control -------- */
#define PAC_EVCTRL_RESETVALUE                 _U_(0x00)                                            /**<  (PAC_EVCTRL) Event control  Reset Value */

#define PAC_EVCTRL_ERREO_Pos                  _U_(0)                                               /**< (PAC_EVCTRL) Peripheral acess error event output Position */
#define PAC_EVCTRL_ERREO_Msk                  (_U_(0x1) << PAC_EVCTRL_ERREO_Pos)                   /**< (PAC_EVCTRL) Peripheral acess error event output Mask */
#define PAC_EVCTRL_ERREO(value)               (PAC_EVCTRL_ERREO_Msk & ((value) << PAC_EVCTRL_ERREO_Pos))
#define PAC_EVCTRL_Msk                        _U_(0x01)                                            /**< (PAC_EVCTRL) Register Mask  */


/* -------- PAC_INTENCLR : (PAC Offset: 0x08) (R/W 8) Interrupt enable clear -------- */
#define PAC_INTENCLR_RESETVALUE               _U_(0x00)                                            /**<  (PAC_INTENCLR) Interrupt enable clear  Reset Value */

#define PAC_INTENCLR_ERR_Pos                  _U_(0)                                               /**< (PAC_INTENCLR) Peripheral access error interrupt disable Position */
#define PAC_INTENCLR_ERR_Msk                  (_U_(0x1) << PAC_INTENCLR_ERR_Pos)                   /**< (PAC_INTENCLR) Peripheral access error interrupt disable Mask */
#define PAC_INTENCLR_ERR(value)               (PAC_INTENCLR_ERR_Msk & ((value) << PAC_INTENCLR_ERR_Pos))
#define PAC_INTENCLR_Msk                      _U_(0x01)                                            /**< (PAC_INTENCLR) Register Mask  */


/* -------- PAC_INTENSET : (PAC Offset: 0x09) (R/W 8) Interrupt enable set -------- */
#define PAC_INTENSET_RESETVALUE               _U_(0x00)                                            /**<  (PAC_INTENSET) Interrupt enable set  Reset Value */

#define PAC_INTENSET_ERR_Pos                  _U_(0)                                               /**< (PAC_INTENSET) Peripheral access error interrupt enable Position */
#define PAC_INTENSET_ERR_Msk                  (_U_(0x1) << PAC_INTENSET_ERR_Pos)                   /**< (PAC_INTENSET) Peripheral access error interrupt enable Mask */
#define PAC_INTENSET_ERR(value)               (PAC_INTENSET_ERR_Msk & ((value) << PAC_INTENSET_ERR_Pos))
#define PAC_INTENSET_Msk                      _U_(0x01)                                            /**< (PAC_INTENSET) Register Mask  */


/* -------- PAC_INTFLAGAHB : (PAC Offset: 0x10) (R/W 32) Bridge interrupt flag status -------- */
#define PAC_INTFLAGAHB_RESETVALUE             _U_(0x00)                                            /**<  (PAC_INTFLAGAHB) Bridge interrupt flag status  Reset Value */

#define PAC_INTFLAGAHB_SRAM0_Pos              _U_(0)                                               /**< (PAC_INTFLAGAHB) SRAM0 Position */
#define PAC_INTFLAGAHB_SRAM0_Msk              (_U_(0x1) << PAC_INTFLAGAHB_SRAM0_Pos)               /**< (PAC_INTFLAGAHB) SRAM0 Mask */
#define PAC_INTFLAGAHB_SRAM0(value)           (PAC_INTFLAGAHB_SRAM0_Msk & ((value) << PAC_INTFLAGAHB_SRAM0_Pos))
#define PAC_INTFLAGAHB_SRAM1_Pos              _U_(1)                                               /**< (PAC_INTFLAGAHB) SRAM1 Position */
#define PAC_INTFLAGAHB_SRAM1_Msk              (_U_(0x1) << PAC_INTFLAGAHB_SRAM1_Pos)               /**< (PAC_INTFLAGAHB) SRAM1 Mask */
#define PAC_INTFLAGAHB_SRAM1(value)           (PAC_INTFLAGAHB_SRAM1_Msk & ((value) << PAC_INTFLAGAHB_SRAM1_Pos))
#define PAC_INTFLAGAHB_SRAM2_Pos              _U_(2)                                               /**< (PAC_INTFLAGAHB) SRAM2 Position */
#define PAC_INTFLAGAHB_SRAM2_Msk              (_U_(0x1) << PAC_INTFLAGAHB_SRAM2_Pos)               /**< (PAC_INTFLAGAHB) SRAM2 Mask */
#define PAC_INTFLAGAHB_SRAM2(value)           (PAC_INTFLAGAHB_SRAM2_Msk & ((value) << PAC_INTFLAGAHB_SRAM2_Pos))
#define PAC_INTFLAGAHB_SRAM3_Pos              _U_(3)                                               /**< (PAC_INTFLAGAHB) SRAM3 Position */
#define PAC_INTFLAGAHB_SRAM3_Msk              (_U_(0x1) << PAC_INTFLAGAHB_SRAM3_Pos)               /**< (PAC_INTFLAGAHB) SRAM3 Mask */
#define PAC_INTFLAGAHB_SRAM3(value)           (PAC_INTFLAGAHB_SRAM3_Msk & ((value) << PAC_INTFLAGAHB_SRAM3_Pos))
#define PAC_INTFLAGAHB_CFLASH_Pos             _U_(4)                                               /**< (PAC_INTFLAGAHB) CFLASH Position */
#define PAC_INTFLAGAHB_CFLASH_Msk             (_U_(0x1) << PAC_INTFLAGAHB_CFLASH_Pos)              /**< (PAC_INTFLAGAHB) CFLASH Mask */
#define PAC_INTFLAGAHB_CFLASH(value)          (PAC_INTFLAGAHB_CFLASH_Msk & ((value) << PAC_INTFLAGAHB_CFLASH_Pos))
#define PAC_INTFLAGAHB_PFLASH_Pos             _U_(5)                                               /**< (PAC_INTFLAGAHB) PFLASH Position */
#define PAC_INTFLAGAHB_PFLASH_Msk             (_U_(0x1) << PAC_INTFLAGAHB_PFLASH_Pos)              /**< (PAC_INTFLAGAHB) PFLASH Mask */
#define PAC_INTFLAGAHB_PFLASH(value)          (PAC_INTFLAGAHB_PFLASH_Msk & ((value) << PAC_INTFLAGAHB_PFLASH_Pos))
#define PAC_INTFLAGAHB_HPBA_Pos               _U_(6)                                               /**< (PAC_INTFLAGAHB) HPBA Position */
#define PAC_INTFLAGAHB_HPBA_Msk               (_U_(0x1) << PAC_INTFLAGAHB_HPBA_Pos)                /**< (PAC_INTFLAGAHB) HPBA Mask */
#define PAC_INTFLAGAHB_HPBA(value)            (PAC_INTFLAGAHB_HPBA_Msk & ((value) << PAC_INTFLAGAHB_HPBA_Pos))
#define PAC_INTFLAGAHB_HPBB_Pos               _U_(7)                                               /**< (PAC_INTFLAGAHB) HPBB Position */
#define PAC_INTFLAGAHB_HPBB_Msk               (_U_(0x1) << PAC_INTFLAGAHB_HPBB_Pos)                /**< (PAC_INTFLAGAHB) HPBB Mask */
#define PAC_INTFLAGAHB_HPBB(value)            (PAC_INTFLAGAHB_HPBB_Msk & ((value) << PAC_INTFLAGAHB_HPBB_Pos))
#define PAC_INTFLAGAHB_HPBC_Pos               _U_(8)                                               /**< (PAC_INTFLAGAHB) HPBC Position */
#define PAC_INTFLAGAHB_HPBC_Msk               (_U_(0x1) << PAC_INTFLAGAHB_HPBC_Pos)                /**< (PAC_INTFLAGAHB) HPBC Mask */
#define PAC_INTFLAGAHB_HPBC(value)            (PAC_INTFLAGAHB_HPBC_Msk & ((value) << PAC_INTFLAGAHB_HPBC_Pos))
#define PAC_INTFLAGAHB_HPBPIC_Pos             _U_(9)                                               /**< (PAC_INTFLAGAHB) HPBPIC0 Position */
#define PAC_INTFLAGAHB_HPBPIC_Msk             (_U_(0x1) << PAC_INTFLAGAHB_HPBPIC_Pos)              /**< (PAC_INTFLAGAHB) HPBPIC0 Mask */
#define PAC_INTFLAGAHB_HPBPIC(value)          (PAC_INTFLAGAHB_HPBPIC_Msk & ((value) << PAC_INTFLAGAHB_HPBPIC_Pos))
#define PAC_INTFLAGAHB_QSPI_Pos               _U_(10)                                              /**< (PAC_INTFLAGAHB) QSPI Position */
#define PAC_INTFLAGAHB_QSPI_Msk               (_U_(0x1) << PAC_INTFLAGAHB_QSPI_Pos)                /**< (PAC_INTFLAGAHB) QSPI Mask */
#define PAC_INTFLAGAHB_QSPI(value)            (PAC_INTFLAGAHB_QSPI_Msk & ((value) << PAC_INTFLAGAHB_QSPI_Pos))
#define PAC_INTFLAGAHB_PUKCC_Pos              _U_(11)                                              /**< (PAC_INTFLAGAHB) PUKCC Position */
#define PAC_INTFLAGAHB_PUKCC_Msk              (_U_(0x1) << PAC_INTFLAGAHB_PUKCC_Pos)               /**< (PAC_INTFLAGAHB) PUKCC Mask */
#define PAC_INTFLAGAHB_PUKCC(value)           (PAC_INTFLAGAHB_PUKCC_Msk & ((value) << PAC_INTFLAGAHB_PUKCC_Pos))
#define PAC_INTFLAGAHB_Msk                    _U_(0x00000FFF)                                      /**< (PAC_INTFLAGAHB) Register Mask  */

#define PAC_INTFLAGAHB_SRAM_Pos               _U_(0)                                               /**< (PAC_INTFLAGAHB Position) SRAMx */
#define PAC_INTFLAGAHB_SRAM_Msk               (_U_(0xF) << PAC_INTFLAGAHB_SRAM_Pos)                /**< (PAC_INTFLAGAHB Mask) SRAM */
#define PAC_INTFLAGAHB_SRAM(value)            (PAC_INTFLAGAHB_SRAM_Msk & ((value) << PAC_INTFLAGAHB_SRAM_Pos)) 

/* -------- PAC_INTFLAGA : (PAC Offset: 0x14) (R/W 32) Peripheral interrupt flag status - Bridge A -------- */
#define PAC_INTFLAGA_RESETVALUE               _U_(0x00)                                            /**<  (PAC_INTFLAGA) Peripheral interrupt flag status - Bridge A  Reset Value */

#define PAC_INTFLAGA_PAC_Pos                  _U_(0)                                               /**< (PAC_INTFLAGA) PAC Position */
#define PAC_INTFLAGA_PAC_Msk                  (_U_(0x1) << PAC_INTFLAGA_PAC_Pos)                   /**< (PAC_INTFLAGA) PAC Mask */
#define PAC_INTFLAGA_PAC(value)               (PAC_INTFLAGA_PAC_Msk & ((value) << PAC_INTFLAGA_PAC_Pos))
#define PAC_INTFLAGA_FREQM_Pos                _U_(1)                                               /**< (PAC_INTFLAGA) FREQM Position */
#define PAC_INTFLAGA_FREQM_Msk                (_U_(0x1) << PAC_INTFLAGA_FREQM_Pos)                 /**< (PAC_INTFLAGA) FREQM Mask */
#define PAC_INTFLAGA_FREQM(value)             (PAC_INTFLAGA_FREQM_Msk & ((value) << PAC_INTFLAGA_FREQM_Pos))
#define PAC_INTFLAGA_EIC_Pos                  _U_(2)                                               /**< (PAC_INTFLAGA) EIC Position */
#define PAC_INTFLAGA_EIC_Msk                  (_U_(0x1) << PAC_INTFLAGA_EIC_Pos)                   /**< (PAC_INTFLAGA) EIC Mask */
#define PAC_INTFLAGA_EIC(value)               (PAC_INTFLAGA_EIC_Msk & ((value) << PAC_INTFLAGA_EIC_Pos))
#define PAC_INTFLAGA_SERCOM0_Pos              _U_(3)                                               /**< (PAC_INTFLAGA) SERCOM0 Position */
#define PAC_INTFLAGA_SERCOM0_Msk              (_U_(0x1) << PAC_INTFLAGA_SERCOM0_Pos)               /**< (PAC_INTFLAGA) SERCOM0 Mask */
#define PAC_INTFLAGA_SERCOM0(value)           (PAC_INTFLAGA_SERCOM0_Msk & ((value) << PAC_INTFLAGA_SERCOM0_Pos))
#define PAC_INTFLAGA_SERCOM1_Pos              _U_(4)                                               /**< (PAC_INTFLAGA) SERCOM1 Position */
#define PAC_INTFLAGA_SERCOM1_Msk              (_U_(0x1) << PAC_INTFLAGA_SERCOM1_Pos)               /**< (PAC_INTFLAGA) SERCOM1 Mask */
#define PAC_INTFLAGA_SERCOM1(value)           (PAC_INTFLAGA_SERCOM1_Msk & ((value) << PAC_INTFLAGA_SERCOM1_Pos))
#define PAC_INTFLAGA_TC0_Pos                  _U_(5)                                               /**< (PAC_INTFLAGA) TC0 Position */
#define PAC_INTFLAGA_TC0_Msk                  (_U_(0x1) << PAC_INTFLAGA_TC0_Pos)                   /**< (PAC_INTFLAGA) TC0 Mask */
#define PAC_INTFLAGA_TC0(value)               (PAC_INTFLAGA_TC0_Msk & ((value) << PAC_INTFLAGA_TC0_Pos))
#define PAC_INTFLAGA_TC1_Pos                  _U_(6)                                               /**< (PAC_INTFLAGA) TC1 Position */
#define PAC_INTFLAGA_TC1_Msk                  (_U_(0x1) << PAC_INTFLAGA_TC1_Pos)                   /**< (PAC_INTFLAGA) TC1 Mask */
#define PAC_INTFLAGA_TC1(value)               (PAC_INTFLAGA_TC1_Msk & ((value) << PAC_INTFLAGA_TC1_Pos))
#define PAC_INTFLAGA_TC2_Pos                  _U_(7)                                               /**< (PAC_INTFLAGA) TC2 Position */
#define PAC_INTFLAGA_TC2_Msk                  (_U_(0x1) << PAC_INTFLAGA_TC2_Pos)                   /**< (PAC_INTFLAGA) TC2 Mask */
#define PAC_INTFLAGA_TC2(value)               (PAC_INTFLAGA_TC2_Msk & ((value) << PAC_INTFLAGA_TC2_Pos))
#define PAC_INTFLAGA_TC3_Pos                  _U_(8)                                               /**< (PAC_INTFLAGA) TC3 Position */
#define PAC_INTFLAGA_TC3_Msk                  (_U_(0x1) << PAC_INTFLAGA_TC3_Pos)                   /**< (PAC_INTFLAGA) TC3 Mask */
#define PAC_INTFLAGA_TC3(value)               (PAC_INTFLAGA_TC3_Msk & ((value) << PAC_INTFLAGA_TC3_Pos))
#define PAC_INTFLAGA_TCC0_Pos                 _U_(9)                                               /**< (PAC_INTFLAGA) TCC0 Position */
#define PAC_INTFLAGA_TCC0_Msk                 (_U_(0x1) << PAC_INTFLAGA_TCC0_Pos)                  /**< (PAC_INTFLAGA) TCC0 Mask */
#define PAC_INTFLAGA_TCC0(value)              (PAC_INTFLAGA_TCC0_Msk & ((value) << PAC_INTFLAGA_TCC0_Pos))
#define PAC_INTFLAGA_TCC1_Pos                 _U_(10)                                              /**< (PAC_INTFLAGA) TCC1 Position */
#define PAC_INTFLAGA_TCC1_Msk                 (_U_(0x1) << PAC_INTFLAGA_TCC1_Pos)                  /**< (PAC_INTFLAGA) TCC1 Mask */
#define PAC_INTFLAGA_TCC1(value)              (PAC_INTFLAGA_TCC1_Msk & ((value) << PAC_INTFLAGA_TCC1_Pos))
#define PAC_INTFLAGA_TCC2_Pos                 _U_(11)                                              /**< (PAC_INTFLAGA) TCC2 Position */
#define PAC_INTFLAGA_TCC2_Msk                 (_U_(0x1) << PAC_INTFLAGA_TCC2_Pos)                  /**< (PAC_INTFLAGA) TCC2 Mask */
#define PAC_INTFLAGA_TCC2(value)              (PAC_INTFLAGA_TCC2_Msk & ((value) << PAC_INTFLAGA_TCC2_Pos))
#define PAC_INTFLAGA_Msk                      _U_(0x00000FFF)                                      /**< (PAC_INTFLAGA) Register Mask  */

