Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ451/include/component/pac.h
/* -------- PAC_STATUSA : (PAC Offset: 0x34) ( R/ 32) Peripheral write protection status - Bridge A -------- */
#define PAC_STATUSA_RESETVALUE                _U_(0x10000)                                         /**<  (PAC_STATUSA) Peripheral write protection status - Bridge A  Reset Value */

#define PAC_STATUSA_PAC_Pos                   _U_(0)                                               /**< (PAC_STATUSA) PAC APB Protect Enable Position */
#define PAC_STATUSA_PAC_Msk                   (_U_(0x1) << PAC_STATUSA_PAC_Pos)                    /**< (PAC_STATUSA) PAC APB Protect Enable Mask */
#define PAC_STATUSA_PAC(value)                (PAC_STATUSA_PAC_Msk & ((value) << PAC_STATUSA_PAC_Pos))
#define PAC_STATUSA_FREQM_Pos                 _U_(1)                                               /**< (PAC_STATUSA) FREQM APB Protect Enable Position */
#define PAC_STATUSA_FREQM_Msk                 (_U_(0x1) << PAC_STATUSA_FREQM_Pos)                  /**< (PAC_STATUSA) FREQM APB Protect Enable Mask */
#define PAC_STATUSA_FREQM(value)              (PAC_STATUSA_FREQM_Msk & ((value) << PAC_STATUSA_FREQM_Pos))
#define PAC_STATUSA_EIC_Pos                   _U_(2)                                               /**< (PAC_STATUSA) EIC APB Protect Enable Position */
#define PAC_STATUSA_EIC_Msk                   (_U_(0x1) << PAC_STATUSA_EIC_Pos)                    /**< (PAC_STATUSA) EIC APB Protect Enable Mask */
#define PAC_STATUSA_EIC(value)                (PAC_STATUSA_EIC_Msk & ((value) << PAC_STATUSA_EIC_Pos))
#define PAC_STATUSA_SERCOM0_Pos               _U_(3)                                               /**< (PAC_STATUSA) SERCOM0 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM0_Msk               (_U_(0x1) << PAC_STATUSA_SERCOM0_Pos)                /**< (PAC_STATUSA) SERCOM0 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM0(value)            (PAC_STATUSA_SERCOM0_Msk & ((value) << PAC_STATUSA_SERCOM0_Pos))
#define PAC_STATUSA_SERCOM1_Pos               _U_(4)                                               /**< (PAC_STATUSA) SERCOM1 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM1_Msk               (_U_(0x1) << PAC_STATUSA_SERCOM1_Pos)                /**< (PAC_STATUSA) SERCOM1 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM1(value)            (PAC_STATUSA_SERCOM1_Msk & ((value) << PAC_STATUSA_SERCOM1_Pos))
#define PAC_STATUSA_TC0_Pos                   _U_(5)                                               /**< (PAC_STATUSA) TC0 APB Protect Enable Position */
#define PAC_STATUSA_TC0_Msk                   (_U_(0x1) << PAC_STATUSA_TC0_Pos)                    /**< (PAC_STATUSA) TC0 APB Protect Enable Mask */
#define PAC_STATUSA_TC0(value)                (PAC_STATUSA_TC0_Msk & ((value) << PAC_STATUSA_TC0_Pos))
#define PAC_STATUSA_TC1_Pos                   _U_(6)                                               /**< (PAC_STATUSA) TC1 APB Protect Enable Position */
#define PAC_STATUSA_TC1_Msk                   (_U_(0x1) << PAC_STATUSA_TC1_Pos)                    /**< (PAC_STATUSA) TC1 APB Protect Enable Mask */
#define PAC_STATUSA_TC1(value)                (PAC_STATUSA_TC1_Msk & ((value) << PAC_STATUSA_TC1_Pos))
#define PAC_STATUSA_TC2_Pos                   _U_(7)                                               /**< (PAC_STATUSA) TC2 APB Protect Enable Position */
#define PAC_STATUSA_TC2_Msk                   (_U_(0x1) << PAC_STATUSA_TC2_Pos)                    /**< (PAC_STATUSA) TC2 APB Protect Enable Mask */
#define PAC_STATUSA_TC2(value)                (PAC_STATUSA_TC2_Msk & ((value) << PAC_STATUSA_TC2_Pos))
#define PAC_STATUSA_TC3_Pos                   _U_(8)                                               /**< (PAC_STATUSA) TC3 APB Protect Enable Position */
#define PAC_STATUSA_TC3_Msk                   (_U_(0x1) << PAC_STATUSA_TC3_Pos)                    /**< (PAC_STATUSA) TC3 APB Protect Enable Mask */
#define PAC_STATUSA_TC3(value)                (PAC_STATUSA_TC3_Msk & ((value) << PAC_STATUSA_TC3_Pos))
#define PAC_STATUSA_TCC0_Pos                  _U_(9)                                               /**< (PAC_STATUSA) TCC0 APB Protect Enable Position */
#define PAC_STATUSA_TCC0_Msk                  (_U_(0x1) << PAC_STATUSA_TCC0_Pos)                   /**< (PAC_STATUSA) TCC0 APB Protect Enable Mask */
#define PAC_STATUSA_TCC0(value)               (PAC_STATUSA_TCC0_Msk & ((value) << PAC_STATUSA_TCC0_Pos))
#define PAC_STATUSA_TCC1_Pos                  _U_(10)                                              /**< (PAC_STATUSA) TCC1 APB Protect Enable Position */
#define PAC_STATUSA_TCC1_Msk                  (_U_(0x1) << PAC_STATUSA_TCC1_Pos)                   /**< (PAC_STATUSA) TCC1 APB Protect Enable Mask */
#define PAC_STATUSA_TCC1(value)               (PAC_STATUSA_TCC1_Msk & ((value) << PAC_STATUSA_TCC1_Pos))
#define PAC_STATUSA_TCC2_Pos                  _U_(11)                                              /**< (PAC_STATUSA) TCC2 APB Protect Enable Position */
#define PAC_STATUSA_TCC2_Msk                  (_U_(0x1) << PAC_STATUSA_TCC2_Pos)                   /**< (PAC_STATUSA) TCC2 APB Protect Enable Mask */
#define PAC_STATUSA_TCC2(value)               (PAC_STATUSA_TCC2_Msk & ((value) << PAC_STATUSA_TCC2_Pos))
#define PAC_STATUSA_Msk                       _U_(0x00000FFF)                                      /**< (PAC_STATUSA) Register Mask  */

#define PAC_STATUSA_SERCOM_Pos                _U_(3)                                               /**< (PAC_STATUSA Position) SERCOMx APB Protect Enable */
#define PAC_STATUSA_SERCOM_Msk                (_U_(0x3) << PAC_STATUSA_SERCOM_Pos)                 /**< (PAC_STATUSA Mask) SERCOM */
#define PAC_STATUSA_SERCOM(value)             (PAC_STATUSA_SERCOM_Msk & ((value) << PAC_STATUSA_SERCOM_Pos)) 
#define PAC_STATUSA_TC_Pos                    _U_(5)                                               /**< (PAC_STATUSA Position) TCx APB Protect Enable */
#define PAC_STATUSA_TC_Msk                    (_U_(0xF) << PAC_STATUSA_TC_Pos)                     /**< (PAC_STATUSA Mask) TC */
#define PAC_STATUSA_TC(value)                 (PAC_STATUSA_TC_Msk & ((value) << PAC_STATUSA_TC_Pos)) 
#define PAC_STATUSA_TCC_Pos                   _U_(9)                                               /**< (PAC_STATUSA Position) TCC2 APB Protect Enable */
#define PAC_STATUSA_TCC_Msk                   (_U_(0x7) << PAC_STATUSA_TCC_Pos)                    /**< (PAC_STATUSA Mask) TCC */
#define PAC_STATUSA_TCC(value)                (PAC_STATUSA_TCC_Msk & ((value) << PAC_STATUSA_TCC_Pos)) 

/* -------- PAC_STATUSB : (PAC Offset: 0x38) ( R/ 32) Peripheral write protection status - Bridge B -------- */
#define PAC_STATUSB_RESETVALUE                _U_(0x02)                                            /**<  (PAC_STATUSB) Peripheral write protection status - Bridge B  Reset Value */

#define PAC_STATUSB_DSU_Pos                   _U_(0)                                               /**< (PAC_STATUSB) DSU APB Protect Enable Position */
#define PAC_STATUSB_DSU_Msk                   (_U_(0x1) << PAC_STATUSB_DSU_Pos)                    /**< (PAC_STATUSB) DSU APB Protect Enable Mask */
#define PAC_STATUSB_DSU(value)                (PAC_STATUSB_DSU_Msk & ((value) << PAC_STATUSB_DSU_Pos))
#define PAC_STATUSB_DMAC_Pos                  _U_(2)                                               /**< (PAC_STATUSB) DMAC APB Protect Enable Position */
#define PAC_STATUSB_DMAC_Msk                  (_U_(0x1) << PAC_STATUSB_DMAC_Pos)                   /**< (PAC_STATUSB) DMAC APB Protect Enable Mask */
#define PAC_STATUSB_DMAC(value)               (PAC_STATUSB_DMAC_Msk & ((value) << PAC_STATUSB_DMAC_Pos))
#define PAC_STATUSB_EVSYS_Pos                 _U_(3)                                               /**< (PAC_STATUSB) EVSYS APB Protect Enable Position */
#define PAC_STATUSB_EVSYS_Msk                 (_U_(0x1) << PAC_STATUSB_EVSYS_Pos)                  /**< (PAC_STATUSB) EVSYS APB Protect Enable Mask */
#define PAC_STATUSB_EVSYS(value)              (PAC_STATUSB_EVSYS_Msk & ((value) << PAC_STATUSB_EVSYS_Pos))
#define PAC_STATUSB_RAMECC_Pos                _U_(4)                                               /**< (PAC_STATUSB) RAMECC APB Protect Enable Position */
#define PAC_STATUSB_RAMECC_Msk                (_U_(0x1) << PAC_STATUSB_RAMECC_Pos)                 /**< (PAC_STATUSB) RAMECC APB Protect Enable Mask */
#define PAC_STATUSB_RAMECC(value)             (PAC_STATUSB_RAMECC_Msk & ((value) << PAC_STATUSB_RAMECC_Pos))
#define PAC_STATUSB_Msk                       _U_(0x0000001D)                                      /**< (PAC_STATUSB) Register Mask  */


/* -------- PAC_STATUSC : (PAC Offset: 0x3C) ( R/ 32) Peripheral write protection status - Bridge C -------- */
#define PAC_STATUSC_RESETVALUE                _U_(0x00)                                            /**<  (PAC_STATUSC) Peripheral write protection status - Bridge C  Reset Value */

#define PAC_STATUSC_QSPI_Pos                  _U_(0)                                               /**< (PAC_STATUSC) QSPI APB Protect Enable Position */
#define PAC_STATUSC_QSPI_Msk                  (_U_(0x1) << PAC_STATUSC_QSPI_Pos)                   /**< (PAC_STATUSC) QSPI APB Protect Enable Mask */
#define PAC_STATUSC_QSPI(value)               (PAC_STATUSC_QSPI_Msk & ((value) << PAC_STATUSC_QSPI_Pos))
#define PAC_STATUSC_AES_Pos                   _U_(1)                                               /**< (PAC_STATUSC) AES APB Protect Enable Position */
#define PAC_STATUSC_AES_Msk                   (_U_(0x1) << PAC_STATUSC_AES_Pos)                    /**< (PAC_STATUSC) AES APB Protect Enable Mask */
#define PAC_STATUSC_AES(value)                (PAC_STATUSC_AES_Msk & ((value) << PAC_STATUSC_AES_Pos))
#define PAC_STATUSC_SERCOM2_Pos               _U_(3)                                               /**< (PAC_STATUSC) SERCOM2 APB Protect Enable Position */
#define PAC_STATUSC_SERCOM2_Msk               (_U_(0x1) << PAC_STATUSC_SERCOM2_Pos)                /**< (PAC_STATUSC) SERCOM2 APB Protect Enable Mask */
#define PAC_STATUSC_SERCOM2(value)            (PAC_STATUSC_SERCOM2_Msk & ((value) << PAC_STATUSC_SERCOM2_Pos))
#define PAC_STATUSC_SERCOM3_Pos               _U_(4)                                               /**< (PAC_STATUSC) SERCOM3 APB Protect Enable Position */
#define PAC_STATUSC_SERCOM3_Msk               (_U_(0x1) << PAC_STATUSC_SERCOM3_Pos)                /**< (PAC_STATUSC) SERCOM3 APB Protect Enable Mask */
#define PAC_STATUSC_SERCOM3(value)            (PAC_STATUSC_SERCOM3_Msk & ((value) << PAC_STATUSC_SERCOM3_Pos))
#define PAC_STATUSC_CCL_Pos                   _U_(6)                                               /**< (PAC_STATUSC) CCL APB Protect Enable Position */
#define PAC_STATUSC_CCL_Msk                   (_U_(0x1) << PAC_STATUSC_CCL_Pos)                    /**< (PAC_STATUSC) CCL APB Protect Enable Mask */
#define PAC_STATUSC_CCL(value)                (PAC_STATUSC_CCL_Msk & ((value) << PAC_STATUSC_CCL_Pos))
#define PAC_STATUSC_AC_Pos                    _U_(7)                                               /**< (PAC_STATUSC) AC APB Protect Enable Position */
#define PAC_STATUSC_AC_Msk                    (_U_(0x1) << PAC_STATUSC_AC_Pos)                     /**< (PAC_STATUSC) AC APB Protect Enable Mask */
#define PAC_STATUSC_AC(value)                 (PAC_STATUSC_AC_Msk & ((value) << PAC_STATUSC_AC_Pos))
#define PAC_STATUSC_TRNG_Pos                  _U_(10)                                              /**< (PAC_STATUSC) TRNG APB Protect Enable Position */
#define PAC_STATUSC_TRNG_Msk                  (_U_(0x1) << PAC_STATUSC_TRNG_Pos)                   /**< (PAC_STATUSC) TRNG APB Protect Enable Mask */
#define PAC_STATUSC_TRNG(value)               (PAC_STATUSC_TRNG_Msk & ((value) << PAC_STATUSC_TRNG_Pos))
#define PAC_STATUSC_Msk                       _U_(0x000004DB)                                      /**< (PAC_STATUSC) Register Mask  */

